In [68]:
import pandas as pd

In [69]:
data_origin = pd.read_csv("Data_pandas.csv")
data = data_origin.copy()

In [70]:
data.head(1)

,ID,Name,LogInTime,LogOutTime,PurchaseNum,Location,PurchaseAmount,Saving
0,101,Jack,2018/2/10 13:10,2018/2/10 14:30,1,Home,150.0,1500

In [71]:
data.tail(1)

,ID,Name,LogInTime,LogOutTime,PurchaseNum,Location,PurchaseAmount,Saving
18,103,Tom,2018/11/11 15:25,2018/11/11 19:45,1,Home,50.0,3045

In [72]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19 entries, 0 to 18
Data columns (total 8 columns):
ID                19 non-null int64
Name              19 non-null object
LogInTime         19 non-null object
LogOutTime        19 non-null object
PurchaseNum       19 non-null int64
Location          19 non-null object
PurchaseAmount    15 non-null float64
Saving            19 non-null int64
dtypes: float64(1), int64(3), object(4)
memory usage: 1.3+ KB

In [73]:
data.describe()

               ID  PurchaseNum  PurchaseAmount       Saving
count   19.000000    19.000000       15.000000    19.000000
mean   101.947368     1.473684       78.200000  1878.789474
std      0.911268     1.218762       58.419909  1113.136988
min    101.000000     0.000000       20.000000   670.000000
25%    101.000000     1.000000       40.000000  1016.000000
50%    102.000000     1.000000       50.000000  1350.000000
75%    103.000000     2.000000       97.500000  3095.000000
max    103.000000     4.000000      200.000000  3500.000000

In [74]:
data.index

RangeIndex(start=0, stop=19, step=1)

In [75]:
data.columns

Index(['ID', 'Name', 'LogInTime', 'LogOutTime', 'PurchaseNum', 'Location',
       'PurchaseAmount', 'Saving'],
      dtype='object')

# Difference between `iloc[]` and `loc[]`

## `loc[]`
### Only receive labels (single label or list of lagels) and boolean value

## `iloc[]`
### Only receive integer (single integer or list of integers) and boolean value

# Select single value

In [76]:
# In `iloc[]`, for slicing index, it includes the start but not include the end.
# Starting from 0.

## Using position to select single value

In [77]:
data.head(3)

,ID,Name,LogInTime,LogOutTime,PurchaseNum,Location,PurchaseAmount,Saving
0,101,Jack,2018/2/10 13:10,2018/2/10 14:30,1,Home,150.0,1500
1,101,Jack,2018/2/15 18:00,2018/2/15 19:00,0,Home,NaN,1350
2,101,Jack,2018/2/15 20:00,2018/2/15 22:30,0,Home,NaN,1350

#### Select the data point using range index

In [78]:
data.iloc[1:2,2:3]

         LogInTime
1  2018/2/15 18:00

#### Select the data point using single integer

In [79]:
data.iloc[1,2]

'2018/2/15 18:00'

#### Select the data point using list of integers

In [80]:
data.iloc[[1],[2]]

         LogInTime
1  2018/2/15 18:00

## Using column names & row indices to select single value

In [81]:
# Row index starts from 0
# This is using column name and row index to selece value instead of row number. Because the default row index starts from 0 and increase 1 by each row.

#### Select the data point using a single label

In [85]:
data.loc["index_1","LogInTime"]

'2018/2/15 18:00'

In [86]:
data = data_origin

#### Select data points by labels when the row index is default

In [87]:
data.loc[1,"LogInTime"]

'2018/2/15 18:00'

In [88]:
data.index

RangeIndex(start=0, stop=19, step=1)

In [89]:
# Set new index
new_index = []
for i in range(len(data)):
    new_index.append("index_" + str(i))
data.index = new_index

#### Select data points when row index is not default value

In [91]:
data.loc["index_1","LogInTime"]

'2018/2/15 18:00'

#### The "number" label doesn't work now

In [ ]:
# Cannot run after assigning new value to row indices
# data.loc[1,"LogInTime"]

In [45]:
# Avoid this method
# https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#indexing-view-versus-copy
# When assign value, there might be warning

data["Name"][2]

'Jack'

#### Select the data point using range idnex of labels

In [93]:
data.loc["index_1":"index_1","LogInTime":"LogInTime"]

               LogInTime
index_1  2018/2/15 18:00

#### Select the data point using a list of labels

In [94]:
data.loc[["index_1"],["LogInTime"]]

               LogInTime
index_1  2018/2/15 18:00

## Using a mix of position & column names/row index to select single value

In [ ]:
# Try to avoid this method
data["LogInTime"][5]

In [27]:
data.head(7)

,ID,Name,LogInTime,LogOutTime,PurchaseNum,Location,PurchaseAmount,Saving
index_0,101,Jack,2018/2/10 13:10,2018/2/10 14:30,1,Home,150.0,1500
index_1,101,Jack,2018/2/15 18:00,2018/2/15 19:00,0,Home,NaN,1350
index_2,101,Jack,2018/2/15 20:00,2018/2/15 22:30,0,Home,NaN,1350
index_3,101,Jack,2018/3/11 10:50,2018/3/11 15:00,2,Outside,190.0,1350
index_4,101,Jack,2018/3/11 15:15,2018/3/11 18:00,1,Home,30.0,1160
index_5,101,Jack,2018/5/10 18:00,2018/5/10 21:00,4,Home,100.0,1130
index_6,101,Jack,2018/7/12 17:40,2018/7/12 18:20,2,Work,28.0,1030

#### Select the data point in 2nd row and LogInTime

In [95]:
data.iloc[1:2,:].loc[:,"LogInTime"]

index_1    2018/2/15 18:00
Name: LogInTime, dtype: object

In [97]:
data.loc["index_1":"index_1",:].iloc[:,2:3]

               LogInTime
index_1  2018/2/15 18:00

### Try NOT to do this!

#### Even though it works some times.

In [99]:
data["LogInTime"][1] = 5

/Users/lush/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.